---
kind: type
id: T:Autodesk.Revit.DB.PaperSourceSetIterator
source: html/dd316cd4-ac08-b1e2-2d36-4cc9250d0e78.htm
---
# Autodesk.Revit.DB.PaperSourceSetIterator

An iterator to a set of paper source objects.

## Syntax (C#)
```csharp
public abstract class PaperSourceSetIterator : APIObject,
	IEnumerator
```